{
  "greeting": {
    "hey": "hoi",
    "hello-guest-nice-no-meet-you": "Hallo lieve gast! Aangenaam kennis te maken!"
  },
  "scroll-down-to-get-me-know": "Scroll naar beneden om mij te leren kennen",
  "languages": {
    "en": "English",
    "de": "Duitsland",
    "ua": "Українська",
    "pl": "Polski",
    "fr": "Français",
    "sp": "Español"
  },
  "my-name": "Yurii Husak",
  "mail-me": "stuur me een bericht",
  "about-my-self": {
    "title": "Over mezelf",
    "aim-details": "Het doel bij het kennen van de details",
    "pedantic": "Pedant, zelforganiserend en verantwoordelijk voor taken die aan mij zijn toegewezen",
    "desire": "De wens om te creëren waar ik trots op zou willen zijn",
    "respect": "Respecteer het werk dat gedaan is door een maat",
    "easily-communicate": "Kan gemakkelijk een manier vinden om met andere mensen te communiceren",
    "resolve-problem": "Probeer een paar voorstellen te doen om een probleem op te lossen",
    "cold-critical": "'Koud' en kritisch denken",
    "like-learn": "Leer graag nieuwe benaderingen, technologieën en methoden voor het oplossen van problemen",
    "my-name-is": "Mijn naam is",
    "i-frontend-developer": "Ik ben een frontend ontwikkelaar met meer dan 5 jaar ervaring",
    "have-questions-or-proposals": "Als je vragen of voorstellen hebt, klik dan gerust op de onderstaande knop"
  },
  "tech-block": {
    "main-stack": {
      "title": "Hauptstapel",
      "description": "Angular 2-14 SPA/PWA projekt. Skalierbar und gut organisiert, könnte mit dem NX-Monorepo-Ansatz durchgeführt werden"
    },
    "styling": {
      "title": "Styling",
      "description": "CSS3/SCSS/PostCSS in kombination mit UI-bibliotheken: Material UI, PrimeNg, Kendo, EaNG, Ngx-bootstrap"
    },
    "skeleton": {
      "title": "Skelett",
      "description": "HTML5/PUG"
    },
    "functionality": {
      "title": "Funktionalität",
      "description": "TS (3+), JS (ES6+)"
    },
    "patterns": {
      "title": "Patterns",
      "description": "Die projektarchitektur kann auf den folgenden mustern basieren oder elegant mit ihnen zusammenarbeiten: OOP, reaktive programmierung basierend auf RxJS-operatoren, funktionale programmierung"
    },
    "uikit": {
      "title": "Uikit",
      "description": "Aktualisieren Sie Ihre Dokumente und UiKit mit Storybook + JsDoc + Compodoc"
    },
    "tests": {
      "title": "Tests",
      "description": "Erweiterte einheitentests mit dem Jest-Framework. Integration und e2e-Tests mit Jasmine und Cypress"
    },
    "state-management": {
      "title": "Staatliche Verwaltung",
      "description": "Verpacken sie ihre ereignisarchitektur basierend auf dem redux-muster und verwenden sie die beliebteste Implementierung davon – NGRX"
    },
    "libs": {
      "title": "Libs",
      "description": "ag-Grid, Husky, Fullcalendar, Highcharts, Moment.js/Date-fns, Lodash, Quill. Frameworks: ReactJs, NestJs und Ionic3+ nutzung auf grund-/mittelstufe"
    },
    "communication-work": {
      "title": "Communication & Work",
      "description": "Jira + Confluence, Skype, Slack, Discord, Microsoft Teams. Agile: Kanban & Scrum methoden, ADRs, straßenkarten, paar-programmierung"
    }
  }
}
